//HERC01CO    JOB (1),'CBL001',CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//COB         EXEC COBUCLG,REGION=1024K
//SYSPUNCH    DD DUMMY
//SYSLIB      DD DSNAME=SYS1.COBLIB,DISP=SHR
//COB.SYSIN   DD DISP=SHR,DSN=ZJO.STUDY.PGM(CBL001)
//LKED.SYSLIB DD DISP=SHR,DSNAME=SYS1.COBLIB
//            DD DISP=SHR,DSNAME=SYS1.LINKLIB
//GO.SYSPRINT DD SYSOUT=*
//GO.PRTLINE  DD SYSOUT=*
//GO.ACCTREC  DD DISP=SHR,DSN=ZJO.STUDY.DATA
